================================================================================
simple comment
================================================================================

(hello, world)

--------------------------------------------------------------------------------

(source_file
  (line
    (comment)))

================================================================================
(logclose)
================================================================================

(logclose)

--------------------------------------------------------------------------------

(source_file
  (line
    (control_comment)))

================================================================================
(logopen)
================================================================================

(logopen,foo.txt)

--------------------------------------------------------------------------------

(source_file
  (line
    (control_comment
      (filename))))

================================================================================
(probeopen)
================================================================================

(probeopen,foo.txt)

--------------------------------------------------------------------------------

(source_file
  (line
    (control_comment
      (filename))))

================================================================================
(probeclose)
================================================================================

(probeclose)

--------------------------------------------------------------------------------

(source_file
  (line
    (control_comment)))

================================================================================
(msg) with no parameters
================================================================================

(msg,hello, world)

--------------------------------------------------------------------------------

(source_file
  (line
    (control_comment)))

================================================================================
(msg) with only parameters
================================================================================

(msg,#1234)

--------------------------------------------------------------------------------

(source_file
  (line
    (control_comment
      (numbered_parameter))))

================================================================================
(msg) with mix of parameters and text
================================================================================

(msg,hello #1234 world)

--------------------------------------------------------------------------------

(source_file
  (line
    (control_comment
      (numbered_parameter))))

================================================================================
(log) with no parameters
================================================================================

(log,hello, world)

--------------------------------------------------------------------------------

(source_file
  (line
    (control_comment)))

================================================================================
(log) with only parameters
================================================================================

(log,#1234)

--------------------------------------------------------------------------------

(source_file
  (line
    (control_comment
      (numbered_parameter))))

================================================================================
(log) with mix of parameters and text
================================================================================

(log,hello #1234 world)

--------------------------------------------------------------------------------

(source_file
  (line
    (control_comment
      (numbered_parameter))))

================================================================================
(debug) with no parameters
================================================================================

(debug,hello, world)

--------------------------------------------------------------------------------

(source_file
  (line
    (control_comment)))

================================================================================
(debug) with only parameters
================================================================================

(debug,#1234)

--------------------------------------------------------------------------------

(source_file
  (line
    (control_comment
      (numbered_parameter))))

================================================================================
(debug) with mix of parameters and text
================================================================================

(debug,hello #1234 world)

--------------------------------------------------------------------------------

(source_file
  (line
    (control_comment
      (numbered_parameter))))

================================================================================
(print) with no parameters
================================================================================

(print,hello, world)

--------------------------------------------------------------------------------

(source_file
  (line
    (control_comment)))

================================================================================
(print) with only parameters
================================================================================

(print,#1234)

--------------------------------------------------------------------------------

(source_file
  (line
    (control_comment
      (numbered_parameter))))

================================================================================
(print) with mix of parameters and text
================================================================================

(print,hello #1234 world)

--------------------------------------------------------------------------------

(source_file
  (line
    (control_comment
      (numbered_parameter))))

================================================================================
inline comment between words
================================================================================

G0 (hi) G1

--------------------------------------------------------------------------------

(source_file
  (line
    (g)
    (comment)
    (g)))

================================================================================
multiline commment not breaking line
================================================================================

G0 (hi
this is a longer comment
isn't that exciting?) G1

--------------------------------------------------------------------------------

(source_file
  (line
    (g)
    (comment)
    (g)))
